app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @friend = Friend.find(params[:id])
    @friend.destroy
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 51]]